In [1]:
# importação da bilioteca
import pandas as pd

In [2]:
# importação da base de dados
url_dados = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv'
dados = pd.read_csv(url_dados, delimiter=',')

In [3]:
# mostra as 7 primeiras linhas do df
dados.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [4]:
# mostra as 5 últimas linhas do df
dados.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [5]:
# mostra a quantidade de linhas e colunas do df
dados.shape

(18, 4)

In [6]:
# a função describe traz alguns dados básicos do df
dados.describe()

           Idade      Notas
count  18.000000  12.000000
mean   25.500000   6.800000
std     6.070662   2.204953
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

In [7]:
# média da idade dos alunos
medida_idade = dados['Idade'].mean(numeric_only=True)

In [8]:
# média das notas dos alunos
media_notas = dados['Notas'].mean(numeric_only=True)

In [9]:
# desvio padrao da Idade
desvio_padrao_idade = dados['Idade'].std()
desvio_padrao_idade

6.070662334249088

In [10]:
# desvio padrao das Notas
desvio_padrao_notas = dados['Notas'].std()
desvio_padrao_notas

2.204953101954366